УТ_для_edt.РасширениеСмарт/src/InformationRegisters/ТоварныеОграничения/ТоварныеОграничения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="71ecd0a2-defd-4369-ab36-96a816f4a3b0">
  <name>ТоварныеОграничения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Enums/ВариантыИспользованияХарактеристикНоменклатуры/ВариантыИспользованияХарактеристикНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыИспользованияХарактеристикНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ОбщиеДляВидаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныеДляНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОбщиеСДругимВидомНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОбособленнаяЗакупкаПродажа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХарактеристикаМногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантОформленияПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользованиеХарактеристик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АлкогольнаяПродукцияВоВскрытойТаре</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СезоннаяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Описание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>РейтингПродаж</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Марка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КиЗГИСМРазмер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Принципал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КоллекцияНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КоэффициентЕдиницыДляОтчетов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СпособОбеспеченияПотребностей</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СхемаОбеспечения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЦенника</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Качество</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КиЗГИСМВид</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НоменклатураМногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаДляОтчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПлощадьИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПлощадьЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПлощадьЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПлощадьЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладскаяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияСрокаГодности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОблагаетсяНДСУПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодакцизныйТовар</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодРаздел7ДекларацииНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВестиУчетПоГТД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиУчетСертификатовНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаАналитическогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КиЗГИСМСпособВыпускаВОборот</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКПД2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеАнгл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8d7abca0-ac91-4ef9-a1ad-32697b4607d2">
    <name>смартНаименованиеСайт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="13dd1676-d9c6-415f-a4e1-cb9414a09577">
    <name>ЕдиницаИзмеренияТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="deac0f00-4a8f-4d18-a043-7799a7111d39">
    <name>КодВидаНоменклатурнойКлассификации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="064e5a5a-2e2f-47ca-9f01-32f70a8b1c1e">
    <name>НаименованиеВидаНоменклатурнойКлассификации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>ДрагоценныеМатериалы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДрагоценныйМатериал</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Расположение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>1000</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="344b6917-b413-4fae-aadd-d62836822de6">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/ТоварныеОграничения/ManagerModule.bsl
//++ #4314 смарт: Тимофеева 10.09.2025 / Автовзаказ. Доработка ядра расчета
Процедура смартДобавитьПоддержаниеЗапасаРасчетПоСтатистике(КлючиЗаписи, ПараметрыПоСтатистике) Экспорт
	Если Тип(КлючиЗаписи) = Тип("Структура") Тогда
		Ключ = КлючиЗаписи;
		КлючиЗаписи = Новый Массив(1);
		КлючиЗаписи[0] = Ключ;
	КонецЕсли;
	
	ПараметрыДляЗаписи = ПустыеПараметрыТоварногоОграничения();	
	ЗаполнитьЗначенияСвойств(ПараметрыДляЗаписи, ПараметрыПоСтатистике,
		"СтраховоеКоличествоЗапаса, ОбеспечениеЗаказовПриПоддержанииЗапаса"); 
	ПараметрыДляЗаписи.Вставить("смартКоличествоПериодовРасчетаАнализаПродаж", ПараметрыПоСтатистике.смартКоличествоПериодовРасчетаАнализаПродаж); 
	ПараметрыДляЗаписи.Вставить("смартПериодРасчетаАнализаПродаж", ПараметрыПоСтатистике.смартПериодРасчетаАнализаПродаж);
    ПараметрыДляЗаписи.Вставить("смартКоличествоПериодовРасчетаСтраховогоЗапаса", ПараметрыПоСтатистике.смартКоличествоПериодовРасчетаСтраховогоЗапаса);
	ПараметрыДляЗаписи.Вставить("смартПериодРасчетаСтраховогоЗапаса", ПараметрыПоСтатистике.смартПериодРасчетаСтраховогоЗапаса);
	
	ПараметрыДляЗаписи.МетодОбеспеченияПотребностей = Перечисления.МетодыОбеспеченияПотребностей.смартПоддержаниеЗапасаНаСрокПоСтатистике;
	
	ТаблицаТоваров		= ТаблицаТоваров();
	ТаблицаГруппировок	= ТаблицаГруппировок();
	Для каждого Ключ Из КлючиЗаписи Цикл
		Если Ключ.ТипКлюча = "ДетальнаяНастройка" Тогда
			ЗаписьТаблицы = ТаблицаТоваров.Добавить();
			ЗаписьТаблицы.Номенклатура		= Ключ.Номенклатура;
			ЗаписьТаблицы.Характеристика	= Ключ.Характеристика;
			ЗаписьТаблицы.Склад				= Ключ.Склад;
		ИначеЕсли Ключ.ТипКлюча = "ОбщаяНастройка" Тогда
			ЗаписьТаблицы = ТаблицаТоваров.Добавить();
			ЗаписьТаблицы.Номенклатура		= Ключ.Номенклатура;
			ЗаписьТаблицы.Склад				= Ключ.Склад;
		ИначеЕсли Ключ.ТипКлюча = "Группировка" Тогда
			ЗаписьТаблицы = ТаблицаГруппировок.Добавить();
			ЗаписьТаблицы.Группировка		= Ключ.Группировка;
		Иначе
			ВызватьИсключение НСтр("ru = 'Недопустимый тип ключа записи!'");;
		КонецЕсли;
	КонецЦикла;
	
	Записать(ТаблицаТоваров, ТаблицаГруппировок, ПараметрыДляЗаписи);
КонецПроцедуры

&ИзменениеИКонтроль("ПараметрыПоддержанияЗапасаТовараНаСкладе")
Функция смарт_ПараметрыПоддержанияЗапасаТовараНаСкладе(Ключ)

	Если Ключ.Свойство("Группировка") Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварныеОграничения.Группировка,
		|	ТоварныеОграничения.СтраховоеКоличествоЗапаса,
		|	ТоварныеОграничения.МинимальноеКоличествоЗапаса,
		|	ТоварныеОграничения.МаксимальноеКоличествоЗапаса,
		|	ТоварныеОграничения.НормаПотребления,
		|	ТоварныеОграничения.МетодОбеспеченияПотребностей,
		|	ТоварныеОграничения.УпаковкаЗаказа,
		|	ТоварныеОграничения.ОбеспечениеЗаказовПриПоддержанииЗапаса,
		|	""ДЛЯ_ГРУППЫ_ТОВАРОВ"" КАК СпособУказанияНастройки
		#Вставка
		//++ #4314 смарт: Тимофеева 10.09.2025 / Автовзаказ. Доработка ядра расчета
		|   ,
		|	ТоварныеОграничения.смартКоличествоПериодовРасчетаАнализаПродаж,
		|	ТоварныеОграничения.смартПериодРасчетаАнализаПродаж,
		|	ТоварныеОграничения.смартКоличествоПериодовРасчетаСтраховогоЗапаса,
		|	ТоварныеОграничения.смартПериодРасчетаСтраховогоЗапаса
		//-- #4314 смарт: Тимофеева 10.09.2025
		#КонецВставки
		|ИЗ
		|	РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
		|ГДЕ
		|	ТоварныеОграничения.Группировка = &Группировка
		|	И ТоварныеОграничения.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И ТоварныеОграничения.ЭтоДействующийПараметр";

		Запрос.УстановитьПараметр("Группировка", Ключ.Группировка);
		Выборка = Запрос.Выполнить().Выбрать();

	Иначе

		Запрос = Новый Запрос();
		Запрос.Текст =
		"ВЫБРАТЬ
		|	&Номенклатура   КАК Номенклатура,
		|	&Характеристика КАК Характеристика,
		|	&Склад          КАК Склад
		|ПОМЕСТИТЬ ВтКлючЗаписи
		|;
		|
		|////////////////////////////////////////
		|ВЫБРАТЬ
		|	&СпособУказанияНастройки                                   КАК СпособУказанияНастройки,
		|	ТоварныеОграничения.Группировка                            КАК Группировка,
		|	ТоварныеОграничения.СтраховоеКоличествоЗапаса              КАК СтраховоеКоличествоЗапаса,
		|	ТоварныеОграничения.МинимальноеКоличествоЗапаса            КАК МинимальноеКоличествоЗапаса,
		|	ТоварныеОграничения.МаксимальноеКоличествоЗапаса           КАК МаксимальноеКоличествоЗапаса,
		|	ТоварныеОграничения.НормаПотребления                       КАК НормаПотребления,
		|	ТоварныеОграничения.МетодОбеспеченияПотребностей           КАК МетодОбеспеченияПотребностей,
		|	ТоварныеОграничения.УпаковкаЗаказа                         КАК УпаковкаЗаказа,
		|	ТоварныеОграничения.ОбеспечениеЗаказовПриПоддержанииЗапаса КАК ОбеспечениеЗаказовПриПоддержанииЗапаса
		#Вставка
		//++ #4314 смарт: Тимофеева 10.09.2025 / Автовзаказ. Доработка ядра расчета
		|   , 
		|	ТоварныеОграничения.смартКоличествоПериодовРасчетаАнализаПродаж 	КАК смартКоличествоПериодовРасчетаАнализаПродаж,
		|	ТоварныеОграничения.смартПериодРасчетаАнализаПродаж					КАК смартПериодРасчетаАнализаПродаж,
		|	ТоварныеОграничения.смартКоличествоПериодовРасчетаСтраховогоЗапаса	КАК смартКоличествоПериодовРасчетаСтраховогоЗапаса,
		|	ТоварныеОграничения.смартПериодРасчетаСтраховогоЗапаса				КАК смартПериодРасчетаСтраховогоЗапаса
		//-- #4314 смарт: Тимофеева 10.09.2025
		#КонецВставки
		|ИЗ
		|	ВтКлючЗаписи КАК КлючЗаписи
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
		|		ПО &ПодстановкаТоварногоОграничения";

		Запрос.Текст = ПодставитьСоединение(
		Запрос.Текст,
		"ПодстановкаТоварногоОграничения",
		"КлючЗаписи.Номенклатура,КлючЗаписи.Характеристика,КлючЗаписи.Склад");

		// Вычисление поля "Способ указания настройки", использует служебные таблицы функции ПодставитьСоединение(...).
		ПодстановкаСпособУказанияНастройки =
		"ВЫБОР КОГДА НЕ НастройкаДетальная.Номенклатура ЕСТЬ NULL ТОГДА
		|			ВЫБОР КОГДА НастройкаДетальная.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|					И НастройкаДетальная.Номенклатура.ИспользованиеХарактеристик 
		|					<> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать) ТОГДА
		|				""ДЛЯ_ХАРАКТЕРИСТИК_ТОВАРА""
		|			ИНАЧЕ
		|				""ДЛЯ_ТОВАРА""
		|			КОНЕЦ
		|		КОГДА НЕ ПринадлежностьГруппе.Номенклатура ЕСТЬ NULL
		|				ИЛИ НЕ НастройкаГруппировкиОбщейНастройки.Номенклатура ЕСТЬ NULL ТОГДА
		|			""ДЛЯ_ГРУППЫ_ТОВАРОВ""
		|		КОГДА НЕ НастройкаОбщая.Номенклатура ЕСТЬ NULL ТОГДА
		|			""ДЛЯ_ХАРАКТЕРИСТИК_ТОВАРА""
		|		ИНАЧЕ
		|			NULL
		|	КОНЕЦ";

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СпособУказанияНастройки", ПодстановкаСпособУказанияНастройки);

		Запрос.УстановитьПараметр("Номенклатура",   Ключ.Номенклатура);
		Запрос.УстановитьПараметр("Характеристика", Ключ.Характеристика);
		Запрос.УстановитьПараметр("Склад",          Ключ.Склад);

		Выборка = Запрос.Выполнить().Выбрать();

	КонецЕсли;

	ЗначениеНастройки = Новый Структура();
	ЗначениеНастройки.Вставить("СпособУказанияНастройки", "НЕ_УКАЗАНА");
	ЗначениеНастройки.Вставить("Группировка", Справочники.ГруппировкиТоварныхОграничений.ПустаяСсылка());
	ЗначениеНастройки.Вставить("МетодОбеспеченияПотребностей", Перечисления.МетодыОбеспеченияПотребностей.ЗаказПодЗаказ);
	ЗначениеНастройки.Вставить("СтраховоеКоличествоЗапаса", 0.000);
	ЗначениеНастройки.Вставить("МинимальноеКоличествоЗапаса", 0.000);
	ЗначениеНастройки.Вставить("МаксимальноеКоличествоЗапаса", 0.000);
	ЗначениеНастройки.Вставить("НормаПотребления", 0.000);
	ЗначениеНастройки.Вставить("УпаковкаЗаказа", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
	ЗначениеНастройки.Вставить("ОбеспечениеЗаказовПриПоддержанииЗапаса", Перечисления.ОбеспечениеЗаказовПриПоддержанииЗапаса.ЗаСчетЗапасов);
    #Вставка
	//++ #4314 смарт: Тимофеева 10.09.2025 / Автовзаказ. Доработка ядра расчета
	ЗначениеНастройки.Вставить("смартКоличествоПериодовРасчетаАнализаПродаж", 0);
	ЗначениеНастройки.Вставить("смартПериодРасчетаАнализаПродаж", Перечисления.Периодичность.ПустаяСсылка());
	ЗначениеНастройки.Вставить("смартКоличествоПериодовРасчетаСтраховогоЗапаса", 0);
	ЗначениеНастройки.Вставить("смартПериодРасчетаСтраховогоЗапаса", Перечисления.Периодичность.ПустаяСсылка());
	//-- #4314 смарт: Тимофеева 10.09.2025
	#КонецВставки
		
	Если Выборка.Следующий() И Выборка.СпособУказанияНастройки <> NULL Тогда

		ЗаполнитьЗначенияСвойств(ЗначениеНастройки, Выборка);

	КонецЕсли;

	Если ЗначениеНастройки.МетодОбеспеченияПотребностей <> Перечисления.МетодыОбеспеченияПотребностей.ПоддержаниеЗапасаНаСрокПоНорме Тогда
		ЗначениеНастройки.НормаПотребления = 0.000;
	КонецЕсли;

	Возврат ЗначениеНастройки;

КонецФункции     

&ИзменениеИКонтроль("ОбновитьРекомендацииПоИзменениюОбщихНастроек")
Процедура смарт_ОбновитьРекомендацииПоИзменениюОбщихНастроек(ОбщиеНастройки, Группировки)

	Если ОбщиеНастройки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ТоварныеОграничения");
	ЭлементБлокировки.ИсточникДанных = ОбщиеНастройки;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	Блокировка.Заблокировать();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбщиеНастройки.Номенклатура,
	|	ОбщиеНастройки.Склад
	|ПОМЕСТИТЬ ВтОбщиеНастройки
	|ИЗ
	|	&ОбщиеНастройки КАК ОбщиеНастройки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ЕСТЬNULL(ВЫБОР
	|				КОГДА ЕСТЬNULL(ГруппировкиДетальныхНастроек.МетодОбеспеченияПотребностей, ДетальныеНастройки.МетодОбеспеченияПотребностей) <> ЗНАЧЕНИЕ(Перечисление.МетодыОбеспеченияПотребностей.ПустаяСсылка)
	|						И ЕСТЬNULL(ГруппировкиДетальныхНастроек.МетодОбеспеченияПотребностей, ДетальныеНастройки.МетодОбеспеченияПотребностей) <> ЗНАЧЕНИЕ(Перечисление.МетодыОбеспеченияПотребностей.ЗаказПодЗаказ)
	|					ТОГДА ДетальныеНастройки.ЕстьРекомендацияПоИзменению
	|				ИНАЧЕ НЕ ДетальныеНастройки.ЕстьРекомендацияПоИзменению
	|			КОНЕЦ, ИСТИНА)) КАК ЕстьРекомендацияПоИзменению,
	|	ТоварныеОграничения.Склад,
	|	ТоварныеОграничения.Номенклатура,
	|	ТоварныеОграничения.Характеристика,
	|	ТоварныеОграничения.Группировка,
	|	ТоварныеОграничения.СтраховоеКоличествоЗапаса,
	|	ТоварныеОграничения.МинимальноеКоличествоЗапаса,
	|	ТоварныеОграничения.МаксимальноеКоличествоЗапаса,
	|	ТоварныеОграничения.НормаПотребления,
	|	ТоварныеОграничения.МетодОбеспеченияПотребностей,
	|	ТоварныеОграничения.УпаковкаЗаказа,
	#Вставка
	//++ #4314 смарт: Тимофеева 10.09.2025 / Автовзаказ. Доработка ядра расчета 
	|   ТоварныеОграничения.смартКоличествоПериодовРасчетаАнализаПродаж,
	|   ТоварныеОграничения.смартПериодРасчетаАнализаПродаж,
	|   ТоварныеОграничения.смартКоличествоПериодовРасчетаСтраховогоЗапаса,
	|   ТоварныеОграничения.смартПериодРасчетаСтраховогоЗапаса,
	//-- #4314 смарт: Тимофеева 10.09.2025	
	#КонецВставки
	|	ТоварныеОграничения.ОбеспечениеЗаказовПриПоддержанииЗапаса,
	|	ТоварныеОграничения.СреднедневноеПотребление,
	|	ТоварныеОграничения.СреднееОтклонениеПотребления,
	|	ТоварныеОграничения.РеквизитДопУпорядочивания,
	|	ТоварныеОграничения.ДатаРасчетаРекомендаций,
	|	ТоварныеОграничения.ЭтоДействующийПараметр,
	|	ТоварныеОграничения.ЭтоГруппировка
	|ИЗ
	|	ВтОбщиеНастройки КАК ОбщиеНастройки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ДетальныеНастройки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ГруппировкиДетальныхНастроек
	|			ПО ДетальныеНастройки.Группировка = ГруппировкиДетальныхНастроек.Группировка
	|				И (ДетальныеНастройки.Склад = ЗНАЧЕНИЕ(Справочник.ГруппировкиТоварныхОграничений.ПустаяСсылка))
	|		ПО ОбщиеНастройки.Номенклатура = ДетальныеНастройки.Номенклатура
	|			И ОбщиеНастройки.Склад = ДетальныеНастройки.Склад
	|			И (ДетальныеНастройки.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
	|		ПО ОбщиеНастройки.Номенклатура = ТоварныеОграничения.Номенклатура
	|			И ОбщиеНастройки.Склад = ТоварныеОграничения.Склад
	|			И (ТоварныеОграничения.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|			И ТоварныеОграничения.ЭтоДействующийПараметр
	|ГДЕ
	|	НЕ ТоварныеОграничения.Склад ЕСТЬ NULL
	|	И ОбщиеНастройки.Номенклатура.ИспользованиеХарактеристик <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварныеОграничения.Склад,
	|	ТоварныеОграничения.Номенклатура,
	|	ТоварныеОграничения.Характеристика,
	|	ТоварныеОграничения.Группировка,
	|	ТоварныеОграничения.СтраховоеКоличествоЗапаса,
	|	ТоварныеОграничения.МинимальноеКоличествоЗапаса,
	|	ТоварныеОграничения.МаксимальноеКоличествоЗапаса,
	|	ТоварныеОграничения.НормаПотребления,
	|	ТоварныеОграничения.МетодОбеспеченияПотребностей,
	|	ТоварныеОграничения.УпаковкаЗаказа,
	#Вставка
	//++ #4314 смарт: Тимофеева 10.09.2025 / Автовзаказ. Доработка ядра расчета 
	|   ТоварныеОграничения.смартКоличествоПериодовРасчетаАнализаПродаж,
	|   ТоварныеОграничения.смартПериодРасчетаАнализаПродаж,
	|   ТоварныеОграничения.смартКоличествоПериодовРасчетаСтраховогоЗапаса,
	|   ТоварныеОграничения.смартПериодРасчетаСтраховогоЗапаса,
	//-- #4314 смарт: Тимофеева 10.09.2025	
	#КонецВставки
	|	ТоварныеОграничения.ОбеспечениеЗаказовПриПоддержанииЗапаса,
	|	ТоварныеОграничения.СреднедневноеПотребление,
	|	ТоварныеОграничения.СреднееОтклонениеПотребления,
	|	ТоварныеОграничения.РеквизитДопУпорядочивания,
	|	ТоварныеОграничения.ДатаРасчетаРекомендаций,
	|	ТоварныеОграничения.ЭтоДействующийПараметр,
	|	ТоварныеОграничения.ЭтоГруппировка,
	|	ТоварныеОграничения.ЕстьРекомендацияПоИзменению
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ЕСТЬNULL(ВЫБОР
	|				КОГДА ДетальныеНастройки.МетодОбеспеченияПотребностей <> ЗНАЧЕНИЕ(Перечисление.МетодыОбеспеченияПотребностей.ПустаяСсылка)
	|						И ДетальныеНастройки.МетодОбеспеченияПотребностей <> ЗНАЧЕНИЕ(Перечисление.МетодыОбеспеченияПотребностей.ЗаказПодЗаказ)
	|					ТОГДА ДетальныеНастройки.ЕстьРекомендацияПоИзменению
	|				ИНАЧЕ НЕ ДетальныеНастройки.ЕстьРекомендацияПоИзменению
	|			КОНЕЦ, ИСТИНА)) <> ТоварныеОграничения.ЕстьРекомендацияПоИзменению";

	Запрос.УстановитьПараметр("ОбщиеНастройки", ОбщиеНастройки);

	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ТоварныеОграничения");
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура",		"Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристика",	"Характеристика");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад",			"Склад");
	Блокировка.Заблокировать();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		Набор = РегистрыСведений.ТоварныеОграничения.СоздатьНаборЗаписей();
		Набор.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
		Набор.Отбор.Характеристика.Установить(Выборка.Характеристика);
		Набор.Отбор.Склад.Установить(Выборка.Склад);

		ЗаписьРегистра = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьРегистра, Выборка);

		Если ЗначениеЗаполнено(Выборка.Группировка) Тогда
			ЗапомнитьГруппировкуДляОбновления(Группировки, Выборка.Группировка, Выборка.Склад, Выборка.ЕстьРекомендацияПоИзменению);
		КонецЕсли;

		Набор.Записать();

	КонецЦикла;

КонецПроцедуры

&ИзменениеИКонтроль("ВременнаяТаблицаТоварыПоддерживаемогоЗапаса")
Функция смарт_ВременнаяТаблицаТоварыПоддерживаемогоЗапаса()

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Таблица.Номенклатура   КАК Номенклатура,
	|	Таблица.Характеристика КАК Характеристика,
	|	Таблица.Склад          КАК Склад,
	|	
	|	ЕСТЬNULL(НастройкаГруппировки.СтраховоеКоличествоЗапаса, Таблица.СтраховоеКоличествоЗапаса)                           КАК СтраховоеКоличествоЗапаса,
	|	ЕСТЬNULL(НастройкаГруппировки.МинимальноеКоличествоЗапаса, Таблица.МинимальноеКоличествоЗапаса)                       КАК МинимальноеКоличествоЗапаса,
	|	ЕСТЬNULL(НастройкаГруппировки.МаксимальноеКоличествоЗапаса, Таблица.МаксимальноеКоличествоЗапаса)                     КАК МаксимальноеКоличествоЗапаса,
	|	ЕСТЬNULL(НастройкаГруппировки.НормаПотребления, Таблица.НормаПотребления)                                             КАК НормаПотребления,
	|	ЕСТЬNULL(НастройкаГруппировки.МетодОбеспеченияПотребностей, Таблица.МетодОбеспеченияПотребностей)                     КАК МетодОбеспеченияПотребностей,
	|	ЕСТЬNULL(НастройкаГруппировки.УпаковкаЗаказа, Таблица.УпаковкаЗаказа)                                                 КАК УпаковкаЗаказа,
	|	ЕСТЬNULL(НастройкаГруппировки.ОбеспечениеЗаказовПриПоддержанииЗапаса, Таблица.ОбеспечениеЗаказовПриПоддержанииЗапаса) КАК ОбеспечениеЗаказовПриПоддержанииЗапаса
	#Вставка     
	|   ,
	|	ЕСТЬNULL(НастройкаГруппировки.смартКоличествоПериодовРасчетаАнализаПродаж, Таблица.смартКоличествоПериодовРасчетаАнализаПродаж) КАК смартКоличествоПериодовРасчетаАнализаПродаж,
	|	ЕСТЬNULL(НастройкаГруппировки.смартПериодРасчетаАнализаПродаж, Таблица.смартПериодРасчетаАнализаПродаж) КАК смартПериодРасчетаАнализаПродаж
	#КонецВставки
	|	
	|ПОМЕСТИТЬ ВтТоварыПоддерживаемогоЗапаса
	|	
	|ИЗ
	|	РегистрСведений.ТоварныеОграничения КАК Таблица
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК НастройкаГруппировки
	|		ПО Таблица.Группировка <> ЗНАЧЕНИЕ(Справочник.ГруппировкиТоварныхОграничений.ПустаяСсылка)
	|			И НастройкаГруппировки.Номенклатура   = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			И НастройкаГруппировки.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			И НастройкаГруппировки.Склад          = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			И НастройкаГруппировки.Группировка    = Таблица.Группировка
	|			И НастройкаГруппировки.ЭтоДействующийПараметр
	|
	|ГДЕ
	|	ЕСТЬNULL(НастройкаГруппировки.МетодОбеспеченияПотребностей, Таблица.МетодОбеспеченияПотребностей) <> ЗНАЧЕНИЕ(Перечисление.МетодыОбеспеченияПотребностей.ЗаказПодЗаказ)
	|	И Таблица.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И (Таблица.Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	|		ИЛИ Таблица.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|	И Таблица.ЭтоДействующийПараметр
	|{ГДЕ
	|	Таблица.Номенклатура.*   КАК Номенклатура,
	|	Таблица.Характеристика.* КАК Характеристика,
	|	Таблица.Склад.*          КАК Склад}
	|
	|{ГДЕ (Таблица.Номенклатура, Таблица.Характеристика) В(
	|	ВЫБРАТЬ
	|		ТаблицаОтбора.Номенклатура   КАК Номенклатура,
	|		ТаблицаОтбора.Характеристика КАК Характеристика
	|	ИЗ
	|		ОтборПоСегментам КАК ТаблицаОтбора
	|	ГДЕ
	|		&ИспользуетсяОтборПоСегментуНоменклатуры)}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Таблица.Номенклатура        КАК Номенклатура,
	|	ТаблицаХарактеристик.Ссылка КАК Характеристика,
	|	Таблица.Склад               КАК Склад,
	|	
	|	ЕСТЬNULL(НастройкаГруппировки.СтраховоеКоличествоЗапаса, Таблица.СтраховоеКоличествоЗапаса)                           КАК СтраховоеКоличествоЗапаса,
	|	ЕСТЬNULL(НастройкаГруппировки.МинимальноеКоличествоЗапаса, Таблица.МинимальноеКоличествоЗапаса)                       КАК МинимальноеКоличествоЗапаса,
	|	ЕСТЬNULL(НастройкаГруппировки.МаксимальноеКоличествоЗапаса, Таблица.МаксимальноеКоличествоЗапаса)                     КАК МаксимальноеКоличествоЗапаса,
	|	ЕСТЬNULL(НастройкаГруппировки.НормаПотребления, Таблица.НормаПотребления)                                             КАК НормаПотребления,
	|	ЕСТЬNULL(НастройкаГруппировки.МетодОбеспеченияПотребностей, Таблица.МетодОбеспеченияПотребностей)                     КАК МетодОбеспеченияПотребностей,
	|	ЕСТЬNULL(НастройкаГруппировки.УпаковкаЗаказа, Таблица.УпаковкаЗаказа)                                                 КАК УпаковкаЗаказа,
	|	ЕСТЬNULL(НастройкаГруппировки.ОбеспечениеЗаказовПриПоддержанииЗапаса, Таблица.ОбеспечениеЗаказовПриПоддержанииЗапаса) КАК ОбеспечениеЗаказовПриПоддержанииЗапаса
	#Вставка     
	|   ,
	|	ЕСТЬNULL(НастройкаГруппировки.смартКоличествоПериодовРасчетаАнализаПродаж, Таблица.смартКоличествоПериодовРасчетаАнализаПродаж) КАК смартКоличествоПериодовРасчетаАнализаПродаж,
	|	ЕСТЬNULL(НастройкаГруппировки.смартПериодРасчетаАнализаПродаж, Таблица.смартПериодРасчетаАнализаПродаж) КАК смартПериодРасчетаАнализаПродаж
	#КонецВставки
	|	
	|ИЗ
	|	РегистрСведений.ТоварныеОграничения КАК Таблица
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ТаблицаНоменклатуры
	|		ПО ТаблицаНоменклатуры.Ссылка = Таблица.Номенклатура
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ТаблицаХарактеристик
	|		ПО ТаблицаХарактеристик.Владелец
	|			= ВЫБОР КОГДА ТаблицаНоменклатуры.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры) ТОГДА
	|						ТаблицаНоменклатуры.Ссылка
	|					КОГДА ТаблицаНоменклатуры.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры) ТОГДА
	|						ТаблицаНоменклатуры.ВидНоменклатуры
	|					КОГДА ТаблицаНоменклатуры.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры) ТОГДА
	|						ТаблицаНоменклатуры.ВладелецХарактеристик
	|				КОНЕЦ
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК НастройкаДетальная
	|		ПО НастройкаДетальная.Номенклатура      = Таблица.Номенклатура
	|			И НастройкаДетальная.Характеристика = ТаблицаХарактеристик.Ссылка
	|			И НастройкаДетальная.Склад          = Таблица.Склад
	|			И НастройкаДетальная.ЭтоДействующийПараметр
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК НастройкаГруппировки
	|		ПО Таблица.Группировка <> ЗНАЧЕНИЕ(Справочник.ГруппировкиТоварныхОграничений.ПустаяСсылка)
	|			И НастройкаГруппировки.Номенклатура   = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			И НастройкаГруппировки.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			И НастройкаГруппировки.Склад          = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			И НастройкаГруппировки.Группировка    = Таблица.Группировка
	|			И НастройкаГруппировки.ЭтоДействующийПараметр
	|		
	|ГДЕ
	|	ЕСТЬNULL(НастройкаГруппировки.МетодОбеспеченияПотребностей, Таблица.МетодОбеспеченияПотребностей) <> ЗНАЧЕНИЕ(Перечисление.МетодыОбеспеченияПотребностей.ЗаказПодЗаказ)
	|	И Таблица.Номенклатура  <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И Таблица.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	И Таблица.Номенклатура.ИспользованиеХарактеристик <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	|	И Таблица.ЭтоДействующийПараметр
	|	И НастройкаДетальная.Склад ЕСТЬ NULL
	|	И НЕ ТаблицаХарактеристик.Ссылка ЕСТЬ NULL
	|{ГДЕ
	|	Таблица.Номенклатура.*   КАК Номенклатура,
	|	Таблица.Характеристика.* КАК Характеристика,
	|	Таблица.Склад.*          КАК Склад}
	|
	|{ГДЕ (Таблица.Номенклатура, Таблица.Характеристика) В(
	|	ВЫБРАТЬ
	|		ТаблицаОтбора.Номенклатура   КАК Номенклатура,
	|		ТаблицаОтбора.Характеристика КАК Характеристика
	|	ИЗ
	|		ОтборПоСегментам КАК ТаблицаОтбора
	|	ГДЕ
	|		&ИспользуетсяОтборПоСегментуНоменклатуры)}
	|
	|;
	|
	|///////////////////////////////////////////////////////////
	|";

	Возврат ТекстЗапроса;

КонецФункции

&ИзменениеИКонтроль("РассчитатьСтатистикуПотребленияТоваров")
Процедура смарт_РассчитатьСтатистикуПотребленияТоваров(МенеджерВременныхТаблиц)

	Курсор = Новый Структура("Номенклатура, Характеристика, Склад");

	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	УстановитьПривилегированныйРежим(Истина);

	Запрос.УстановитьПараметр("НачалоТекущегоДня", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ДатаРасчетаРекомендаций", ТекущаяДатаСеанса());
	ОбеспечениеСервер.УстановитьПараметрыЗапросаРасчетаСтатистики(Запрос);
	#Удаление
	ОбеспечениеСервер.ДобавитьВременнуюТаблицуСтатистикиПотребления(Запрос, "ВтТовары");
	#КонецУдаления
    #Вставка
	//++ #4314 смарт: Тимофеева 10.09.2025 / Автовзаказ. Доработка ядра расчета
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.Склад КАК Склад,
	|	ЕСТЬNULL(НастройкаГруппировки.МетодОбеспеченияПотребностей, ТоварныеОграниченияПоСтроке.МетодОбеспеченияПотребностей) КАК МетодОбеспеченияПотребностей,
	|	ЕСТЬNULL(НастройкаГруппировки.смартКоличествоПериодовРасчетаАнализаПродаж, ТоварныеОграниченияПоСтроке.смартКоличествоПериодовРасчетаАнализаПродаж) КАК смартКоличествоПериодовРасчетаАнализаПродаж,
	|	ЕСТЬNULL(НастройкаГруппировки.смартПериодРасчетаАнализаПродаж, ТоварныеОграниченияПоСтроке.смартПериодРасчетаАнализаПродаж) КАК смартПериодРасчетаАнализаПродаж
	|ПОМЕСТИТЬ ВтТоварыДляРаспределения
	|ИЗ
	|	ВтТовары КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ТоварныеОграниченияПоСтроке
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК НастройкаГруппировки
	|			ПО (НЕ ТоварныеОграниченияПоСтроке.Группировка = ЗНАЧЕНИЕ(Справочник.ГруппировкиТоварныхОграничений.ПустаяСсылка))
	|				И (НастройкаГруппировки.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|				И (НастройкаГруппировки.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|				И (НастройкаГруппировки.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
	|				И (НастройкаГруппировки.Группировка = ТоварныеОграниченияПоСтроке.Группировка)
	|		ПО Т.Номенклатура = ТоварныеОграниченияПоСтроке.Номенклатура
	|			И Т.Характеристика = ТоварныеОграниченияПоСтроке.Характеристика
	|			И Т.Склад = ТоварныеОграниченияПоСтроке.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.Склад КАК Склад
	|ПОМЕСТИТЬ ВтТоварыСИсключением
	|ИЗ
	|	ВтТоварыДляРаспределения КАК Т
	|ГДЕ
	|	НЕ Т.МетодОбеспеченияПотребностей = ЗНАЧЕНИЕ(Перечисление.МетодыОбеспеченияПотребностей.смартПоддержаниеЗапасаНаСрокПоСтатистике)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.Склад КАК Склад,
	|	Т.смартКоличествоПериодовРасчетаАнализаПродаж КАК смартКоличествоПериодовРасчетаАнализаПродаж,
	|	Т.смартПериодРасчетаАнализаПродаж КАК смартПериодРасчетаАнализаПродаж
	|ПОМЕСТИТЬ ВтТоварыСмарт
	|ИЗ
	|	ВтТоварыДляРаспределения КАК Т
	|ГДЕ
	|	Т.МетодОбеспеченияПотребностей = ЗНАЧЕНИЕ(Перечисление.МетодыОбеспеченияПотребностей.смартПоддержаниеЗапасаНаСрокПоСтатистике)";
	Запрос.Выполнить();
	ОбеспечениеСервер.ДобавитьВременнуюТаблицуСтатистикиПотребления(Запрос, "ВтТоварыСИсключением");
	ОбеспечениеСервер.смартДобавитьВременнуюТаблицуСтатистикиПотребления(Запрос, "ВтТоварыСмарт");
	//-- #4314 смарт: Тимофеева 10.09.2025
	#КонецВставки
	
	УстановитьПривилегированныйРежим(Ложь);

	Пока Истина Цикл

		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 100
		|	Т.Номенклатура КАК Номенклатура,
		|	Т.Характеристика КАК Характеристика,
		|	Т.Склад КАК Склад
		|ПОМЕСТИТЬ ТоварыПорция
		|ИЗ
		|	ВтТовары КАК Т
		|ГДЕ
		|	Т.Номенклатура >= &Номенклатура
		|	И (Т.Номенклатура > &Номенклатура ИЛИ Т.Характеристика >= &Характеристика)
		|	И (Т.Номенклатура > &Номенклатура ИЛИ Т.Характеристика > &Характеристика ИЛИ Т.Склад > &Склад)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|// Блокировка изменяемых записей
		|ВЫБРАТЬ
		|	ТоварыПорция.Номенклатура КАК Номенклатура,
		|	ТоварыПорция.Характеристика КАК Характеристика,
		|	ТоварыПорция.Склад КАК Склад
		|ИЗ
		|	ТоварыПорция КАК ТоварыПорция
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|// Блокировка записей общих настроек
		|ВЫБРАТЬ
		|	ТоварыПорция.Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		|	ТоварыПорция.Склад
		|ИЗ
		|	ТоварыПорция КАК ТоварыПорция
		|ГДЕ
		|	ТоварыПорция.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|// Блокировка группировок
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
		|	ТоварыПорция.Склад КАК Склад,
		|	ТоварныеОграничения.Группировка КАК Группировка
		|ИЗ
		|	ТоварыПорция КАК ТоварыПорция
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
		|		ПО ТоварыПорция.Номенклатура = ТоварныеОграничения.Номенклатура
		|		И ТоварыПорция.Склад = ТоварныеОграничения.Склад
		|ГДЕ
		|	ТоварныеОграничения.Группировка <> ЗНАЧЕНИЕ(Справочник.ГруппировкиТоварныхОграничений.ПустаяСсылка)";

		Запрос.УстановитьПараметр("Номенклатура",	Курсор.Номенклатура);
		Запрос.УстановитьПараметр("Характеристика",	Курсор.Характеристика);
		Запрос.УстановитьПараметр("Склад",			Курсор.Склад);

		РезультатыЗапроса = Запрос.ВыполнитьПакет();

		Если РезультатыЗапроса[1].Пустой() Тогда
			Прервать;
		КонецЕсли;

		НачатьТранзакцию();
		Попытка

			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ТоварныеОграничения");
			ЭлементБлокировки.ИсточникДанных = РезультатыЗапроса[1];
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура",		"Номенклатура");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристика",	"Характеристика");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад",			"Склад");

			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ТоварныеОграничения");
			ЭлементБлокировки.ИсточникДанных = РезультатыЗапроса[2];
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура",		"Номенклатура");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад",			"Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Группировка",		"Группировка");

			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ТоварныеОграничения");
			ЭлементБлокировки.ИсточникДанных = РезультатыЗапроса[1];
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура",		"Номенклатура");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад",			"Склад");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;

			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ТоварныеОграничения");
			ЭлементБлокировки.ИсточникДанных = РезультатыЗапроса[2];
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад",			"Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Группировка",		"Группировка");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
			Блокировка.Заблокировать();

			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Т.Номенклатура   КАК Номенклатура,
			|	Т.Характеристика КАК Характеристика,
			|	Т.Склад          КАК Склад,
			|
			|	ТоварныеОграничения.Группировка                            КАК Группировка,
			|	ТоварныеОграничения.МетодОбеспеченияПотребностей           КАК МетодОбеспеченияПотребностей,
			|	ТоварныеОграничения.МинимальноеКоличествоЗапаса            КАК МинимальноеКоличествоЗапаса,
			|	ТоварныеОграничения.МаксимальноеКоличествоЗапаса           КАК МаксимальноеКоличествоЗапаса,
			|	ТоварныеОграничения.НормаПотребления                       КАК НормаПотребления,
			|	ТоварныеОграничения.СтраховоеКоличествоЗапаса              КАК СтраховоеКоличествоЗапаса,
			|	ТоварныеОграничения.ОбеспечениеЗаказовПриПоддержанииЗапаса КАК ОбеспечениеЗаказовПриПоддержанииЗапаса,
			|	ТоварныеОграничения.УпаковкаЗаказа                         КАК УпаковкаЗаказа,
			#Вставка 
			//++ #4314 смарт: Тимофеева 10.09.2025 / Автовзаказ. Доработка ядра расчета
			|	ТоварныеОграничения.смартКоличествоПериодовРасчетаАнализаПродаж	КАК смартКоличествоПериодовРасчетаАнализаПродаж,
			|	ТоварныеОграничения.смартПериодРасчетаАнализаПродаж				КАК смартПериодРасчетаАнализаПродаж,
			|	ТоварныеОграничения.смартКоличествоПериодовРасчетаСтраховогоЗапаса КАК смартКоличествоПериодовРасчетаСтраховогоЗапаса,
			|	ТоварныеОграничения.смартПериодРасчетаСтраховогоЗапаса             КАК смартПериодРасчетаСтраховогоЗапаса,
			//-- #4314 смарт: Тимофеева 10.09.2025
			#КонецВставки
			|
			|	ТоварныеОграничения.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
			|	ТоварныеОграничения.ЭтоДействующийПараметр    КАК ЭтоДействующийПараметр,
			|
			|	ЕСТЬNULL(Статистика.СреднедневноеПотребление, 0) КАК СреднедневноеПотребление,
			|	ЕСТЬNULL(Статистика.ДисперсияПотребления, 0)     КАК ДисперсияПотребления,
			|	&ДатаРасчетаРекомендаций                         КАК ДатаРасчетаРекомендаций,
			|
			|	ТоварныеОграничения.Номенклатура ЕСТЬ NULL КАК НоваяЗапись,
			|	НЕ ЕСТЬNULL(ТоварныеОграничения.ЭтоДействующийПараметр, ЛОЖЬ)
			|		И ЕСТЬNULL(Статистика.СреднедневноеПотребление, 0) = 0
			|		И ЕСТЬNULL(ТоварныеОграничения.УпаковкаЗаказа, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК УдалитьЗапись
			|ИЗ
			|	ТоварыПорция КАК Т
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСтатистикаПотребления КАК Статистика
			|		ПО Т.Номенклатура = Статистика.Номенклатура
			|			И Т.Характеристика = Статистика.Характеристика
			|			И Т.Склад = Статистика.Склад
			|			И Статистика.СреднедневноеПотребление > 0
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
			|		ПО Т.Номенклатура = ТоварныеОграничения.Номенклатура
			|			И Т.Характеристика = ТоварныеОграничения.Характеристика
			|			И Т.Склад = ТоварныеОграничения.Склад
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ТоварыПорция";

			Выборка = Запрос.Выполнить().Выбрать();

			ОбщиеНастройки = ТаблицаОбщихНастроек();
			Группировки = ТаблицаСлужебныхГруппировок();
			
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(Курсор, Выборка);
				
				НаборЗаписей = РегистрыСведений.ТоварныеОграничения.СоздатьНаборЗаписей();
				Если НЕ Выборка.УдалитьЗапись Тогда
					ЗаписьРегистра = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(ЗаписьРегистра, Выборка);
					Если Выборка.НоваяЗапись Тогда
						ЗаписьРегистра.МетодОбеспеченияПотребностей = Перечисления.МетодыОбеспеченияПотребностей.ЗаказПодЗаказ;
						ЗаписьРегистра.ЭтоДействующийПараметр = Ложь;
					КонецЕсли;
					ЗаписьРегистра.СреднееОтклонениеПотребления = Sqrt(Выборка.ДисперсияПотребления);

					ОбновитьРекомендациюПоИзменениюЗаписиРегистра(ЗаписьРегистра);
					Если НЕ ЗаписьРегистра.ЭтоДействующийПараметр И Не ЗаписьРегистра.ЕстьРекомендацияПоИзменению
						И НЕ ЗначениеЗаполнено(ЗаписьРегистра.УпаковкаЗаказа) Тогда
						НаборЗаписей.Удалить(ЗаписьРегистра);
					КонецЕсли;
				КонецЕсли;

				Если Выборка.НоваяЗапись И НаборЗаписей.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;

				// Запоминаем для каких из группировычных записей нужно обновить реквизит ЕстьРекомендацияПоИзменению.
				ЗапомнитьГруппировкуДляОбновления(Группировки, Выборка.Группировка, Выборка.Склад,
				?(НаборЗаписей.Количество() > 0, НаборЗаписей[0].ЕстьРекомендацияПоИзменению, Ложь));
				Если ЗначениеЗаполнено(Выборка.Характеристика) Тогда
					ЗапомнитьОбщуюНастройкуДляОбновления(ОбщиеНастройки, Выборка.Номенклатура, Выборка.Склад);
				КонецЕсли;

				НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
				НаборЗаписей.Отбор.Характеристика.Установить(Выборка.Характеристика);
				НаборЗаписей.Отбор.Склад.Установить(Выборка.Склад);
				НаборЗаписей.Записать();

			КонецЦикла;

			// Проверка правильности заблокированных группировок
			ЗаблокированныеГруппировки = РезультатыЗапроса[2].Выгрузить();
			Отбор = Новый Структура("Группировка, Склад");
			Для каждого ЗаписьГруппировки Из Группировки Цикл
				ЗаполнитьЗначенияСвойств(Отбор, ЗаписьГруппировки);
				НайденныеСтроки = ЗаблокированныеГруппировки.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() = 0 Тогда
					ВызватьИсключение НСтр("ru = 'Несоответствие в транзакции заблокированных и изменяемых группировок'");
				КонецЕсли;
			КонецЦикла;

			ОбновитьРекомендацииПоИзменениюОбщихНастроек(ОбщиеНастройки, Группировки);
			ОбновитьРекомендацииПоИзменениюГруппировок(Группировки);

			ЗафиксироватьТранзакцию();

		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Расчет статистики потребления товаров'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение;
		КонецПопытки;

	КонецЦикла;
	
КонецПроцедуры

//-- #4314 смарт: Тимофеева 10.09.2025
